{ config, lib, pkgs, ... }:

# ==============================================================================
# 网络配置
#   主机名、NetworkManager、SSH
# ==============================================================================

{
  networking.hostName = "westwood";            # 主机名
  networking.networkmanager.enable = true;     # NetworkManager 管理网络

  # ============================================================================
  # SSH 远程访问
  # ============================================================================
  services.openssh.enable = true;
}
